Revit 2024 API
Concrete.ConcreteSealant Property
 The property labeled "Sealant" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string ConcreteSealant { get; }
Visual Basic
Public Shared ReadOnly Property ConcreteSealant As String
	Get
Visual C++
public:
static property String^ ConcreteSealant {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteSealantType".
See Also
Concrete Class
Autodesk.Revit.DB.Visual Namespace